//этап 11
//1)применить trycashblock,finally,throw,throws и так же свои пользовательские кастомные exeption
//2)надо обрадотать основные части программы с категориями с товарами ,переводы,пользовательское меню и т.д везде обработать исключение
//3)так же типовые ошибки допустим товар не найден  так же разработать место ошибок недостаточно денег нету в категории привышен лимит кредиты неверная сумма перевода и т.д
//4)программа не должна падать exeption закрыть критические ошибки
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//